#include "timer1.h"

//// Настройка и управлением таймером 1
/// работает в режиме FAST_PWM
/// TOP - в регистре ICR  сравнение в OCR1A
void Init_TimerT1(void)
{
  /// настрока портов
  /// PB1 - управление силовым ключем
   PORTB &= ~(1<<PB1);  /// выключим ключ
   DDRB |= (1<<PB1);     /// настроим направление ВЫХОД
  /// установим режим работы вывода ОС1А
  /// и вид ШИМ
  TCCR1A = (1<<COM1A1)|(1<<COM1A0) /// режим работы выхода OC1A
              ///Set OC1A/OC1B on Compare Match, clear OC1A/OC1B at TOP
          | (0<<WGM10)|(1<<WGM11);
   TCCR1B = (1<<WGM13)|(1<<WGM12);  /// режим fast PWM
   /// предельное значение ШИМ
   ICR1   = PWM_TOP_VAL;   /// TOP - до чего считаем
   OCR1A  = 0;             /// значение ШИМ - 0
   TCNT1  = 0;
   TCCR1B |= (1<<CS10);    /// запустили таймер
}


/// конец
/***********************************************************************/


